# GetLevelTmpltInfoN

## Description
Used to access the properties of the Story Level Template at 'index'.  The name, scaleFactor, levelType, elevation, and wallHeight parameters of the requested Story Level Template will be returned in the appropriate parameters.

```pascal
FUNCTION GetLevelTmpltInfoN(
				index           : INTEGER;
				VAR layerName   : STRING;
				VAR scaleFactor : REAL;
				VAR levelType   : STRING;
				VAR elevation   : REAL;
				VAR wallHeight  : REAL): BOOLEAN;
```

```python
def vs.GetLevelTmpltInfoN(index):
    return (BOOLEAN, layerName, scaleFactor, levelType, elevation, wallHeight)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|index|INTEGER|The index of the desired Story Level Template.|
|layerName|STRING|The layer name associated with the Story Level Template at 'index'.  If this is empty, the corresponding Story Level Template does not use or create a layer.|
|scaleFactor|REAL|The scale of the layer associated with the Story Level Template at 'index'.  If this layer name is blank, this parameter has no use.|
|levelType|STRING|The level type of the Story Level Template at 'index'.|
|elevation|REAL|The elevation of the Story Level Template at 'index'. The elevation is in document units.|
|wallHeight|REAL|The wall height of the Story Level Template at 'index'. The wall height is in document untis. If the layer name is blank, this parameter has no meaning.|

## See Also
VS Functions:
GetNumLevelTemplates
| GetLevelTemplateName
| SetLevelTemplateName
| CreateLevelTemplateN
| DeleteLevelTemplate
| GetLevelTemplateInfoN

## Version
Availability: from Vectorworks 2025

## Category
* Layers